In [13]:
import pandas as pd

df = pd.read_excel('EVstock1.xlsx')
lpdf1 = pd.read_excel('029.xlsx')
lpdf2 = pd.read_excel('9218.xlsx')
lpdf3 = pd.read_excel('182224.xlsx')

In [14]:
df.head()

  Unnamed: 0  ffnc  ffc  nfnc  nfc  fsnc   fsc  nsnc   nsc
0      신대방1동   1.0  NaN   1.0  NaN   5.0  13.0   5.0  13.0
1       시흥5동   NaN  NaN   NaN  NaN   NaN   2.0   1.0   NaN
2        청담동   1.0  NaN   NaN  2.0  13.0  19.0  26.0   NaN
3       신정4동   NaN  NaN   2.0  NaN   9.0   2.0   NaN   NaN
4         항동   NaN  NaN   NaN  NaN   NaN  11.0   9.0  10.0

In [15]:
df = df.rename(columns = {'Unnamed: 0' : 'dong'})

In [16]:
lpdf1.head()

   행정동명        총생활인구수
0  가락1동  25049.834033
1  가락2동  24935.653890
2  가락본동  33157.590517
3  가리봉동  11048.837409
4   가산동  40838.242876

In [17]:
lpdf1 = lpdf1.rename(columns= {'행정동명' : 'dong'})
lpdf2 = lpdf2.rename(columns= {'행정동명' : 'dong'})
lpdf3 = lpdf3.rename(columns= {'행정동명' : 'dong'})

In [18]:
df1 = pd.merge(df, lpdf1, how = 'right')

In [19]:
df1.info()
# 424개로 잘 저장되어있는것을 확인 할수 있습니다.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 424 entries, 0 to 423
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    424 non-null    object
 1   ffnc    276 non-null    float64
 2   ffc     20 non-null     float64
 3   nfnc    147 non-null    float64
 4   nfc     50 non-null     float64
 5   fsnc    327 non-null    float64
 6   fsc     284 non-null    float64
 7   nsnc    299 non-null    float64
 8   nsc     195 non-null    float64
 9   총생활인구수  424 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.4+ KB

In [20]:
df2 = pd.merge(df, lpdf2, how = 'right')
df3 = pd.merge(df, lpdf3, how = 'right')

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 424 entries, 0 to 423
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    424 non-null    object
 1   ffnc    276 non-null    float64
 2   ffc     20 non-null     float64
 3   nfnc    147 non-null    float64
 4   nfc     50 non-null     float64
 5   fsnc    327 non-null    float64
 6   fsc     284 non-null    float64
 7   nsnc    299 non-null    float64
 8   nsc     195 non-null    float64
 9   총생활인구수  424 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.4+ KB

In [22]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 424 entries, 0 to 423
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    424 non-null    object
 1   ffnc    276 non-null    float64
 2   ffc     20 non-null     float64
 3   nfnc    147 non-null    float64
 4   nfc     50 non-null     float64
 5   fsnc    327 non-null    float64
 6   fsc     284 non-null    float64
 7   nsnc    299 non-null    float64
 8   nsc     195 non-null    float64
 9   총생활인구수  424 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.4+ KB

In [23]:
# 할렐루야!
# 3 파일다 242개로 잘 저장되어네요!
# 이제 만든 파일을 저장해두십니다.
df1.to_excel('029df.xlsx')
df2.to_excel('9218df.xlsx')
df3.to_excel('18224df.xlsx')